[
    {
        "id": "67bdcc6d3e9fb0c20b7b2299",
        "pulse_name": "GhostSocks - Partner In Proxy",
        "created": "2025-02-25T13:58:05.978000",
        "type": "FileHash-SHA256",
        "indicator": "86362ac6d972b1b55f1f434811d014316196f0e193878d8270dae939efb25908",
        "description": "GhostSocks is a Golang-based SOCKS5 backconnect proxy malware first identified in October 2023. It is primarily deployed alongside the LummaC2 information stealer and offered as Malware-as-a-Service. GhostSocks uses a relay-based C2 implementation with HTTP API, allowing attackers to route traffic through infected systems. The malware's integration with Lumma, including automatic provisioning and discounted pricing, enhances post-infection capabilities for credential abuse and anti-fraud bypassing. GhostSocks contains additional backdoor functionality, such as arbitrary command execution and credential modification. Its C2 infrastructure largely operates on VDSina (AS216071), a Russian-speaking server provider. The malware exemplifies the commodification of SOCKS5 backconnect malware in the criminal ecosystem, posing a significant threat to financial institutions and high-value targets.",
        "tags": [
            "lummac2",
            "credential abuse",
            "anti-fraud bypass",
            "golang",
            "backconnect proxy",
            "c2 infrastructure",
            "socks5",
            "vdsina",
            "malware-as-a-service",
            "ghostsocks"
        ],
        "source": "AlienVault OTX"
    },
    {
        "id": "67bd958b5dda19e4363aa95d",
        "pulse_name": "PolarEdge: Unveiling an uncovered ORB network",
        "created": "2025-02-25T10:03:55.448000",
        "type": "CVE",
        "indicator": "CVE-2023-20118",
        "description": "An analysis of the PolarEdge backdoor and its associated botnet reveals a sophisticated cyber threat targeting various edge devices. The botnet exploits vulnerabilities in Cisco, Asus, QNAP, and Synology devices, using a TLS backdoor to establish control. Active since at least late 2023, PolarEdge has infected over 2,000 devices globally, with a significant presence in Asia and South America. The attackers employ complex infrastructure for payload delivery and command and control, utilizing multiple domains and IP addresses. While the botnet's ultimate purpose remains unclear, it's suspected to potentially use compromised devices as Operational Relay Boxes for launching offensive cyber attacks. The sophistication of the operation suggests skilled operators behind this extensive and well-coordinated threat.",
        "tags": [
            "qnap",
            "polaredge",
            "asus",
            "cve-2023-20118",
            "tls backdoor",
            "infrastructure analysis",
            "synology",
            "edge devices",
            "botnet",
            "vulnerability exploitation",
            "cipher_log",
            "cisco"
        ],
        "source": "AlienVault OTX"
    },
    {
        "id": "67bd92f0915699a764c6c705",
        "pulse_name": "Healthcare Malware Hunt, Part 1: Silver Fox APT Targets Philips DICOM Viewers",
        "created": "2025-02-25T09:52:48.037000",
        "type": "FileHash-MD5",
        "indicator": "12283dad2bdc66190c2066ebe6cd2724",
        "description": "Forescout reportead a cyber attack by the Silver Fox APT group on Philips DICOM medical imaging software. The attackers exploited vulnerabilities in the software to gain unauthorized access to sensitive patient data and hospital networks.",
        "tags": [
            "apt",
            "silverfox",
            "healthcare",
            "ics",
            "ot",
            "valleyrat"
        ],
        "source": "AlienVault OTX"
    },
    {
        "id": "67bd2f08a42cda6ca5b61ecf",
        "pulse_name": "Auto-Color: An Emerging and Evasive Linux Backdoor",
        "created": "2025-02-25T02:46:32.217000",
        "type": "FileHash-MD5",
        "indicator": "825bab4fd9b73d70e8ac9b79126a85cd",
        "description": "Auto-color is a newly discovered Linux malware that employs sophisticated evasion techniques. It renames itself to benign-looking filenames, hides remote C2 connections using advanced methods similar to Symbiote malware, and uses proprietary encryption for communication. The malware installs a malicious library implant to intercept system calls and conceal its network activity. It provides threat actors with full remote access to compromised machines and is difficult to remove. Auto-color primarily targets universities and government offices in North America and Asia. The malware's C2 protocol includes a simple handshake and encrypted messages for issuing commands. Its capabilities include file operations, network proxying, and creating reverse shells.",
        "tags": [
            "encryption",
            "auto-color",
            "linux",
            "library implant",
            "backdoor",
            "government",
            "c2",
            "reverse shell",
            "evasion",
            "universities",
            "proxy",
            "symbiote"
        ],
        "source": "AlienVault OTX"
    },
    {
        "id": "67bd2f08a42cda6ca5b61ecf",
        "pulse_name": "Auto-Color: An Emerging and Evasive Linux Backdoor",
        "created": "2025-02-25T02:46:32.217000",
        "type": "FileHash-SHA1",
        "indicator": "0ea8246ebd864f36585fefb4f94c099c3c64b270",
        "description": "Auto-color is a newly discovered Linux malware that employs sophisticated evasion techniques. It renames itself to benign-looking filenames, hides remote C2 connections using advanced methods similar to Symbiote malware, and uses proprietary encryption for communication. The malware installs a malicious library implant to intercept system calls and conceal its network activity. It provides threat actors with full remote access to compromised machines and is difficult to remove. Auto-color primarily targets universities and government offices in North America and Asia. The malware's C2 protocol includes a simple handshake and encrypted messages for issuing commands. Its capabilities include file operations, network proxying, and creating reverse shells.",
        "tags": [
            "encryption",
            "auto-color",
            "linux",
            "library implant",
            "backdoor",
            "government",
            "c2",
            "reverse shell",
            "evasion",
            "universities",
            "proxy",
            "symbiote"
        ],
        "source": "AlienVault OTX"
    },
    {
        "id": "67bc93b2e9c1d45f56f8e90f",
        "pulse_name": "Phishing Campaigns Targeting Higher Education Institutions",
        "created": "2025-02-24T15:43:46.591000",
        "type": "URL",
        "indicator": "http://cutly.today/JNx0r7",
        "description": "Since August 2024, there has been a significant increase in phishing attacks targeting U.S. universities. Three distinct campaigns have emerged, exploiting trust within academic institutions to deceive students, faculty, and staff. One campaign used compromised educational institutions to host Google Forms for phishing. Another involved cloning university login pages and re-hosting them on attacker-controlled infrastructure. A third campaign targeted staff and students in a two-step process, first phishing faculty credentials and then using compromised accounts to target students. These attacks aim to steal login credentials and financial information, often timed to coincide with key dates in the academic calendar. The campaigns employ various tactics to increase perceived legitimacy and perform payment redirection attacks.",
        "tags": [
            "google forms",
            "social engineering",
            "higher education",
            "phishing",
            "payment redirection",
            "universities",
            "business email compromise"
        ],
        "source": "AlienVault OTX"
    }
]